{
    "ооп": "Объектно-ориентированное программирования – это шаблон проектирования программного обеспечения, который позволяет думать о проблемах с точки зрения объектов.",
    "php": "PHP: Hypertext preprocessor – это язык программирования, который используется для разработки серверной части веб-приложений.",
    "javascript": "Интерпретируемый язык программирования, который используется для разработки как клиентской части, так и серверной части веб-приложений.",
    "фреймворк": "Платформа для разработки программных приложений.",
    "api": "Application programming interface – это набор команд, функций, протоколов и объектов, которые программисты могут использовать для создания программного обеспечения или взаимодействия с внешней системой.",
    "прототип": "Специальный объект или механизм, с помощью которого объекты JavaScript наследуют свойства друг от друга.",
    "middleware": "Функции промежуточной обработки, имеющие доступ к объекту запроса, объекту ответа и к следующей функции промежуточной обработки в цикле «запрос-ответ» приложения.",
    "объект": "Структура данных, которая состоит из набора свойств и методов.",
    "класс": "Шаблон или каркас на основе, которого создаются объекты (экземпляры) класса.",
    "суперкласс": "Родительский класс, от которого наследуются другие классы.",
    "класс-наследник": "Класс, который наследует суперкласс.",
    "наследование": "В объектно-ориентированном программировании наследование – это механизм базирования объекта или класса на другом объекте или классе с сохранением аналогичной реализации.",
    "инкапсуляция": "В объектно-ориентированном программировании инкапсуляция означает связывание данных с методами, которые работают с этими данными, или ограничение прямого доступа к некоторым компонентам объекта.",
    "полиморфизм": "Способность объекта принимать разные формы.",
    "абстракция": "Сокрытие реализации конкретного функционала.",
    "ассоциация": "В объектно-ориентированном программировании ассоциация определяет отношения между классами объектов, которые позволяют одному экземпляру объекта побуждать другой выполнять действие от своего имени.",
    "композиция": "Способ объединения объектов или типов данных в более сложные.",
    "пм": "Прототипная модель – это модель на основе, которого реализуется ООП функционал в JavaScript.",
    "мнк": "Модель на основе классов – это модель, которая оперирует классами при реализации ООП функционала.",
    "агрегирование": "Специализированная форма ассоциации между двумя или более объектами, в которой каждый объект имеет свой собственный жизненный цикл, но также существует право собственности."
}